using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleProject_2
{
    enum EnemyType
    { normal, boss }
    internal class Monster : Computer
    {
        static Random randomDir = new Random();
        Direction dir;
        EnemyType enemyType;

        public int exp;
        bool isAttack=false;
        public Monster()
        {
            playerImage = new string[2];
            playerImage[0] = "   @ @  ";
            playerImage[1] = "( *△* )";//<-이거 특수문자 때문에 크기 8 먹는다 [2]*8 배열인듯
            name = "슬라임";
            myBaseStatus.attack = 3;
            myBaseStatus.hp = 10;
            myBaseStatus.defence = 0;
            pos.x = 150;
            pos.y = 57;
            exp = 3;
            enemyType = EnemyType.normal;
            SetMonsterPos(playerImage);
        }
        public Monster(int x=100, int y=30)
        {
            playerImage = new string[2];
            playerImage[0] = "   @ @  ";
            playerImage[1] = "( *△* )";//<-이거 특수문자 때문에 크기 8 먹는다 [2]*8 배열인듯
            name = "일반몹";
            myBaseStatus.attack = 3;
            myBaseStatus.hp = 10;
            myBaseStatus.defence = 0;
            pos.x = x;
            pos.y = y;
            exp = 3;
            enemyType = EnemyType.normal;
            SetMonsterPos(playerImage);
        }
        public Monster(string monsterName, int x, int y, EnemyType type)
        {
            name = monsterName;
            pos.x = x;
            pos.y = y;
            enemyType = type;
            SetMonsterPos(playerImage);
        }

        public void Attack()
        {

        }

        public void BossMonster(int x, int y)
        {
            playerImage = new string[30];
            //보스(1페)
            //한 줄에 79글자
            playerImage[0] = "                    #+#         **###%####                       ##**#         ";
            playerImage[1] = "                 ####%+#      %*=--------=+#%                 ##===+=-=*%      ";
            playerImage[2] = "              ##* #====+%*++**-------------==##**##%#        %+-=++==++++##    ";
            playerImage[3] = "               ##++=++++*+--------------------------=+##    %=++*+=+++*===#    ";
            playerImage[4] = "                 **===+#+----------------------------==+%   #--*++==++*+--*#   ";
            playerImage[5] = "                  %**+=-------------------------------===%  #++**==+-=#++=##   ";
            playerImage[6] = "                 %-------------------------------------===# #+--=##**#+=+*#    ";
            playerImage[7] = "                ##-------------------------------------===%* *#++++==++=##     ";
            playerImage[8] = "               #%*-------------------------------------=====*%*##*++*#%#       ";
            playerImage[9] = "      *%#+*# ##=-------=##*--------------*##=-------==----====#=+#**#*         ";
            playerImage[10] = "   ##==+**=#%*--------+*-*%#-----------=#-=%%=--------=-----=*+++###==-=#%     ";
            playerImage[11] = " #*=*===*=*+*---------+%####-----------=%####+--------------=*=*%#*=*#=+*+=%*  ";
            playerImage[12] = "#=+=---*=-=%-------====****=--*=+%=++---=****===-----------=%##%*#*+==#--==++# ";
            playerImage[13] = "** *#*-==-+*------===++==------------------=+=====-------=%=-----=%=--==-=#%#*%";
            playerImage[14] = "      #%#*%*-------=====-------------------======--------%---------###*+%      ";
            playerImage[15] = "         %+#=---------------------------------------==--=#---------=%          ";
            playerImage[16] = "        %==#+---=-----------------------------------=---=%--------==%          ";
            playerImage[17] = "       +*--=#==-=--------------------------------==-----=#*=----===*#          ";
            playerImage[18] = "       #+--=+#---=-------------------------------------=#=*%+=====*%           ";
            playerImage[19] = "       **--=+*-----------------------------------------#+=#+====#%             ";
            playerImage[20] = "        #*++##=---------------------------------------+*++*=====*#             ";
            playerImage[21] = "             %=-------------=------------------------=#-+%=====*%              ";
            playerImage[22] = "             *#==-------------=====------------------#+=*===+###               ";
            playerImage[23] = "               %+====-------------------------------+++**==*#                  ";
            playerImage[24] = "                 %#*=======-------------============*-+#==*#                   ";
            playerImage[25] = "                   #+=+++**====-----====================+%                     ";
            playerImage[26] = "                    #---==+#*==============*%#*++++*#%#%                       ";
            playerImage[27] = "                    %*----===+##+++==+++#%#%==========*#                       ";
            playerImage[28] = "                     ##=--===+%            #%-----===##                        ";
            playerImage[29] = "                       #%%%%#                #%+=++#%                          ";
            name = "보스";
            myBaseStatus.attack = 10;
            myBaseStatus.hp = 100;
            myBaseStatus.defence = 10;
            pos.x = x;
            pos.y = y;
            exp = 100;
            enemyType = EnemyType.boss;
            SetBossMonsterPos(playerImage);

            ////보스(1페)
            //Console.WriteLine(
            //    "                    #+#         **###%####                       ##**#         \r\n" +
            //    "                 ####%+#      %*=--------=+#%                 ##===+=-=*%      \r\n" +
            //    "              ##* #====+%*++**-------------==##**##%#        %+-=++==++++##    \r\n" +
            //    "               ##++=++++*+--------------------------=+##    %=++*+=+++*===#    \r\n" +
            //    "                 **===+#+----------------------------==+%   #--*++==++*+--*#   \r\n" +
            //    "                  %**+=-------------------------------===%  #++**==+-=#++=##   \r\n" +
            //    "                 %-------------------------------------===# #+--=##**#+=+*#    \r\n" +
            //    "                ##-------------------------------------===%* *#++++==++=##     \r\n" +
            //    "               #%*-------------------------------------=====*%*##*++*#%#       \r\n" +
            //    "      *%#+*# ##=-------=##*--------------*##=-------==----====#=+#**#*         \r\n" +
            //    "   ##==+**=#%*--------+*-*%#-----------=#-=%%=--------=-----=*+++###==-=#%     \r\n" +
            //    " #*=*===*=*+*---------+%####-----------=%####+--------------=*=*%#*=*#=+*+=%*  \r\n" +
            //    "#=+=---*=-=%-------====****=--*=+%=++---=****===-----------=%##%*#*+==#--==++# \r\n" +
            //    "** *#*-==-+*------===++==------------------=+=====-------=%=-----=%=--==-=#%#*%\r\n" +
            //    "      #%#*%*-------=====-------------------======--------%---------###*+%      \r\n" +
            //    "         %+#=---------------------------------------==--=#---------=%          \r\n" +
            //    "        %==#+---=-----------------------------------=---=%--------==%          \r\n" +
            //    "       +*--=#==-=--------------------------------==-----=#*=----===*#          \r\n" +
            //    "       #+--=+#---=-------------------------------------=#=*%+=====*%           \r\n" +
            //    "       **--=+*-----------------------------------------#+=#+====#%             \r\n" +
            //    "        #*++##=---------------------------------------+*++*=====*#             \r\n" +
            //    "             %=-------------=------------------------=#-+%=====*%              \r\n" +
            //    "             *#==-------------=====------------------#+=*===+###               \r\n" +
            //    "               %+====-------------------------------+++**==*#                  \r\n" +
            //    "                 %#*=======-------------============*-+#==*#                   \r\n" +
            //    "                   #+=+++**====-----====================+%                     \r\n" +
            //    "                    #---==+#*==============*%#*++++*#%#%                       \r\n" +
            //    "                    %*----===+##+++==+++#%#%==========*#                       \r\n" +
            //    "                     ##=--===+%            #%-----===##                        \r\n" +
            //    "                       #%%%%#                #%+=++#%                          ");
            ////보스 2페
            //Console.WriteLine(
            //    "                    +#+         **======+=                       *=++=         \r\n" +
            //    "                 =+=+-%=      -*@@@@@@@@@@%=-                 ++@@%%@@@*-      \r\n" +
            //    "              ++* =%@@%%=*##**@@@@@@@@@@@@@@@=+**+=-=        -%@@##@@%###==    \r\n" +
            //    "               =+%#@##%%##@@@@@@@@@@@@@@@@@@@@@@@@@@@%=+    -@%%+#@%%#+@@@=    \r\n" +
            //    "                 **@@@%+%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@%-   +@@*#%@@%%#%@@*=   \r\n" +
            //    "                  -**#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@-  =##**@%%@%=#%@++   \r\n" +
            //    "                 -@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@= =#@@@=+#*=%@#*+    \r\n" +
            //    "                ==@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@-* *=##%%@@##@+=     \r\n" +
            //    "               ==#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*-*==*##*+-=       \r\n" +
            //    "      +-+%*= +=@@@@@@@@@==*@@@@@@@@@@@@@@*==@@@@@@@@@@@@@@@@@@=@#+**=*         \r\n" +
            //    "   =+@@#**@=-#@@@@@@@@%*@*-=@@@@@@@@@@@@=@@--@@@@@@@@@@@@@@@@+#%#===@@@@+=     \r\n" +
            //    " =*@*%@@+%*#*@@@@@@@@@#-=+==@@@@@@@@@@@@-==+=#@@@@@@@@@@@@@@@*%*-=+@*+%%*%@=+  \r\n" +
            //    "=@%@@@@+@@@=@@@@@@@@@@@****@@@*@#-@%#@@@%+***@@@@@@@@@@@@@@@-==-*=*%@@+@@@@#%= \r\n" +
            //    "*# +=+@%@@#*@@@@@@@@@%%@@@@@@@@@@@@@@@@@@@@@%@@%@@@@@@@@@@-@@@@@@@=@@@%@@@+-=#-\r\n" +
            //    "      =-=*-*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@-@@@@@@@@@+++*%=      \r\n" +
            //    "         -%=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=@@@@@@@@@%-          \r\n" +
            //    "        -@@=#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@-@@@@@@@@@%-          \r\n" +
            //    "       %*@@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=*@@@@@@@@*=          \r\n" +
            //    "       =%@@@%=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=@*=%@@@@@*-           \r\n" +
            //    "       #*@@@#*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+%@+%@@@%+-             \r\n" +
            //    "        =*%%++@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#*%#*@@@@@*=             \r\n" +
            //    "             -@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+@#-@@@@@*=              \r\n" +
            //    "             *=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=%@*%@@%+=+               \r\n" +
            //    "               -#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#%#*+@@*=                  \r\n" +
            //    "                 -=*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+@%=@@+=                   \r\n" +
            //    "                   +%@%%%+#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#-                     \r\n" +
            //    "                    =@@@@@%=*@@@@@@@@@@@@@@+-=+#%%##+==-                       \r\n" +
            //    "                    =#@@@@@@@#==#%%%%%%#+-+-@@@@@@@@@@*=                       \r\n" +
            //    "                     +=@@@@@@#-            +-@@@@@@@@++                        \r\n" +
            //    "                       +=---=                ==%@%#+-                          ");


        }
        public void SetBossMonsterPos(string[] s)
        {
            Map.SetMonsterMap(pos.x, pos.y);
            for (int i = 0; i < s.Length; i++)
            {
                Console.SetCursorPosition(pos.x, pos.y + i);
                Console.Write(s[i]);
            }
        }
        public void SetMonsterPos(string[] s)
        {
            isAttack=Map.SetMonsterMap(pos.x, pos.y);
            //Map.SetMonsterMap(pos.x, pos.y);
            Console.SetCursorPosition(pos.x, pos.y);
            Console.Write(s[0]);
            Console.SetCursorPosition(pos.x, pos.y + 1);
            Console.Write(s[1]);
            Map.monsterAttackMap[pos.x, pos.y] = true;

            if (isAttack)
            {
                GameSystem.AttackPlayer(myBaseStatus.attack);
                isAttack = false;
            }
        }

        public void RandomMove()
        {
            dir = (Direction)randomDir.Next(2);
            Move(dir);
        }
        public void Move(Direction dir)
        {
            Map.SetMonsterMap(pos.x, pos.y);
            Console.SetCursorPosition(pos.x, pos.y);
            for (int i = 0; i < 8; i++)
            {
                Console.Write(Map.adventureMap[pos.x + i, pos.y]);
            }
            Console.SetCursorPosition(pos.x, pos.y + 1);
            for (int i = 0; i < 8; i++)
            {
                Console.Write(Map.adventureMap[pos.x + i, pos.y + 1]);
            }



            switch (dir)
            {
                case Direction.left:
                    pos.x--;
                    break;
                case Direction.right:
                    pos.x++;
                    break;
            }
            SetMonsterPos(playerImage);
        }

        public void MoveLeft()
        {
            //특수문자라 -2다 일반이면 -1로 바꿔야 한다
            if (!Map.BaseMap[pos.x - 2, pos.y])
            {
                Move(Direction.left);
            }
        }
        public void MoveRight()
        {
            if (!Map.BaseMap[pos.x + playerImage[1].Length + 1, pos.y])
            {
                Move(Direction.right);
            }
        }

        public void Die()
        {
            for (int i = 0; i < playerImage.Length; i++)
            {
                for (int j = 0; j < playerImage[0].Length;j++)
                {
                    Map.monsterAttackMap[pos.x + j, pos.y + i] = false;
                }
            }
            Map.SetMonsterMap(pos.x, pos.y);

            Console.SetCursorPosition(pos.x, pos.y);
            for (int i = 0; i < 8; i++)
            {
                Console.Write(Map.adventureMap[pos.x + i, pos.y]);
            }
            Console.SetCursorPosition(pos.x, pos.y + 1);
            for (int i = 0; i < 8; i++)
            {
                Console.Write(Map.adventureMap[pos.x + i, pos.y + 1]);
            }
        }
    }
}
